[
  {
    "year": 2019,
    "events": [
      {
        "swiper": [
          "https://sotapmc.oss-cn-beijing.aliyuncs.com/img/201901.webp",
          "https://sotapmc.oss-cn-beijing.aliyuncs.com/img/201902.webp",
          "https://sotap.oss-cn-qingdao.aliyuncs.com/xc6.png",
		  "https://sotap.oss-cn-qingdao.aliyuncs.com/xc4.png"
        ],
        "name": "7月诞生",
        "title": "SoTap 成立",
        "text": "SoTap 自 2019 年 7 月 7 日起开始运行。SoTap 最初的定位，只是一个为 LGBT 群体所营造的 Minecraft 服务器——而后来，我们改变了这一想法。我们开始接受其它游戏的融入，并不定期地组织其它游戏内的竞赛（主要是 LOL、饥荒等），以至于逐渐带有「社区」性质，并不仅仅局限于一个服务器了。"
      },
      {
        "name": "8月",
        "title": "第一次举办大型活动：夏日祭",
        "text": "<img src='https://sotapmc.oss-cn-beijing.aliyuncs.com/img/active.jpg'>这是SoTap开服以来的首个大型活动，我们将夏日分为很多个小活动，拆分为许多天举办。这样是为了照顾到每个玩家的时间安排，为了避免集中一天导致活动安排紧，同时遇到正好有些玩家当天有事的情况。每个玩家也可以选择性参加自己感兴趣的活动。首次夏日祭我们举办了PVP大乱斗、鞘翅飞行比赛、夏日冰船比赛和方块放置比赛。并且之后每年同样的时间我们都会举办夏日祭大型活动。"
      },
      {
        "name": "9月灾难",
		"title": "更换周目事件",
        "text": "SoTap 的定位是永久周目，即永远不会删除地图和玩家数据重新开始游戏进度。但是由于9月份一个错误的操作导致服务器地图的种子改变且无法找回之前的种子号码。由于SoTap地图已经预先生成好了，所以一开始并没有发现问题。但是由于那段时间服务器开启一个定期清理无人使用的区块数据来节约硬盘空间的机制。原本如果世界种子不变，那么区块删除以后重新生成会和以前几乎一样，但是由于种子改变以后，被删掉的区块重新生成以后完全变了样，海洋中凭空出现一整块雪原等，这样导致整个世界地形破碎十分影响玩家体验，而且部分玩家聚落也由于这样导致需要搬迁。"
      },
      {
        "text": "<img src='https://sotap.oss-cn-qingdao.aliyuncs.com/start.png'>由于整个世界地形破碎且没有及时发现种子改变而无法恢复，因此在和玩家沟通以后决定开一个全新的地图，同时挂载旧世界地图，同步2个世界的背包，让玩家可以从旧世界搬迁物品到新世界，尽量减小换地图带来的损失。从那时候开始到现在，SoTap 服务器的地图就一直使用的是这个2019年9月开的图了。最初7月成立之初开的那个地图被永久封存并提供给玩家下载本地游玩纪念。"
      },
      {
        "name": "10月",
        "title": "正式开启白名单",
        "text": "由于从开服到当时开启白名单之前，一直有一些熊孩子进服破坏，以及新玩家普遍待人冷淡归属感不高，导致服务器社区氛围严重下降，经过管理组和玩家一起讨论以后均认为宁缺毋滥，保证新玩家质量、防范熊孩子，开启白名单是一个合理的选择。所以从2019年10月开始，我们开启了白名单，开启以后新玩家加入数量显著下降，但是确实在很长一段时间里让熊服事件显著减少，以及新玩家普遍更友好和乐意参与到社区的建设之中。社区氛围有所提高。"
      },
      {
        "name": "12月",
        "title": "Itemsadder的加入",
        "text": "<img src='https://sotap.oss-cn-qingdao.aliyuncs.com/glance.png'>我们一直在考虑如何增加服务器的玩法和让玩家保持新鲜感。在经过多方面探索以后我们决定使用itemsadder插件，它在保持不安装mod的情况下给服务器增提数百款新物品，食物/载具/药水/方块/矿物/装备。涵盖了mc的方方面面，只需启用一个定制的材质包就可以了。不得不说，在启用该插件的有段时间里确实极大的丰富了服务器玩法和保持玩家在线率，但在2020年6月，我们删除了该插件，因为其后续的维护难度和bug太多导致我们决定放弃它。"
      }
    ]
  },
  {
    "year": 2020,
    "events": [
      {
        "name": "1月",
        "title": "SoTap开放周活动",
        "text": "由于SoTap有白名单的缘故，让很多玩家望而却步。又因为有部分玩家申请白名单通过进来后却发现自己不适合这个服务器，因此浪费了管理组和玩家双方的时间。为了避免这种情况的发生，我们特地的举办了开放周活动，关闭1周的白名单，让所有玩家都可以自由进入游玩，如果觉得心仪的话就可以申请白名单，白名单通过以后在开放周结束重新开启白名单时可以继续游玩。而没有申请白名单或者没有申请通过的玩家则会被白名单所阻挡。"
      },
	  {
		"text": "在1月，我们成功举办了开放周活动，开放周期间玩家在线率显著提高，也遇到了很多新面孔，也有很多新玩家成功得到了白名单。SoTap 在开放周期间吸收了很多的新血液，证明了举办开放周活动是一个正确的决定。"
      },
      {
        "name": "2月",
        "title": "开启正版验证",
        "text": "2月份我们开启了正版验证，所有玩家的UUID重置为正版UUID。服务器仅允许正版登录。为了满足部分学生玩家无钱购买正版的情况，我们开启了游戏币换购正版的活动，帮助了3位玩家通过花费服务器的游戏币免费得到了165元的正版账号。"
      },
      {
        "name": "3月",
		"title": "2020鞘翅飞行大赛",
        "text": "我们在3月举办了一年一度的鞘翅飞行拉力赛，与2019年第一届截图通过每个检查点不同的是，这次是通过插件设定检查点来让玩家依次通过检查点最后插件自动记录飞完全程的时间来判断的。因此这样又快又方便的让玩家得知自己的成绩，玩家的参与度很高，本次飞行拉力赛有<a target='_blank' href='https://www.bilibili.com/video/BV1NE411j75x'>官方演示视频</a>"
      },
      {
        "name": "4月",
		"title": "关闭白名单",
        "text": "<img src='https://sotap.oss-cn-qingdao.aliyuncs.com/xc5.png'>由于SoTap从升级为正版服以及开启白名单以后，虽然社区氛围提高和熊孩子显著减少，但是由于大部分老玩家都已经发展到后期没有上服的动力以及新玩家加入缓慢的原因，服务器在线率一直很低。管理组一直在从各方面考虑如何提高服务器活跃度，但最后都收效甚微。经过玩家提议和管理组讨论，觉得关闭白名单是目前最有效的办法，加上已经有一定的运营和防熊经验，可以有效保证在开放白名单以后玩家财产的安全。因此，在2020年4月，我们关闭了白名单，仅需要正版账号即可进入服务器。"
      },
      {
        "name": "6月",
		"title": "城镇楼兰撕逼事件",
        "text": "<img src='https://sotap.oss-cn-qingdao.aliyuncs.com/tvXXx1.png'>SoTap是有城镇的，几个玩家聚集在一起建立一个城镇，有些城镇自己有一个小群。这并没有什么问题，然而楼兰镇和一名单独生存的玩家在一次关于系统商店收购问题的冲突中，管理组偶然收到了来自该城镇群内的截图，得知原来楼兰镇成员们在内群恶意中伤这名玩家并私下进行言语羞辱。同时在之后的楼兰镇恶意圈末地门事件中，该镇成员在内群私下不悔改还辱骂整个SoTap。因此管理组将其所有涉事玩家集体永久封禁并写了一篇公告文公开其内群的聊天记录，通知其他与SoTap关系友好的服主联合封禁，让所有人看到他们丑恶的嘴脸。相关公告可以在<a target='_blank' href='https://g.sotap.org/d/167-sotap'>此处查看</a>"
      },
      {
        "name": "7月",
		"title": "SoTap一周年！",
        "text": "<img src='https://sotap.oss-cn-qingdao.aliyuncs.com/header-background.png'>不知不觉，就一周年了，在此热烈祝贺！！一年很短，也就365天而已。但却感觉这一年里SoTap经历了很多，在前行的道路上出过错，也及时扳回到正轨。遇到过很多坏人，也得到了很多优秀有爱的玩家支持。每过一年，SoTap的目标都是：再活一年。我们不敢说能存在多久，因为未来充满了不确定因素，但我们会这样一直一点一点的走下去，直到遇到走不下去的那一天，我们想如果真的到了那一天，回过头来看我们足迹的时候，更多的是对这条路长度的惊叹和对路上美丽风景的感恩。"
      },
      {
        "name": "8月",
		"title": "夏雨鸳昂活动",
        "text": "<img src='https://sotapmc.oss-cn-beijing.aliyuncs.com/img/mw.jpg'>这是由SoTap的一个玩家：Majesty_W负责举办的一场大型活动，和夏日祭一样，包含多个小活动并持续几天。项目内容包含射箭比赛、村庄PVP、心跳水立方、跑酷、走迷宫等等。这也是第一个全部由玩家自行筹备、安排提供奖品、建设活动场所的一个大型活动。我们希望在未来能看到越来越多的玩家能积极参与到活动的发起当中，圈子氛围由此活跃起来。该活动的一些视频可以在<a target='_blank' href='https://www.bilibili.com/video/BV1qh411Z7wC'>这里看到</a>"
      },
      {
        "name": "10月",
		"title": "SoTap休服",
        "text": "在暑假开学以后，SoTap陷入了一段低迷的时期，长期服务器在线人数在3人或更低。服务器常常是鬼服，期间举办过几场活动但是反响平平。因此为了保存资源节约消耗，让SoTap能走的更远，我们决定暂时休服，即关服一段时间来节约一部分服务器高额的续费费用。同时能让管理组更好的思考SoTap的下一步该怎么走。"
      },
      {
        "name": "12月",
		"title": "SoTap转型",
        "text": "在经过一段时间的思考以后，我们发现或许“社区”太过于泛而宽了，SoTap的体量并不适合这个定位，做小众垂直化的mc兴趣圈子似乎更适合我们。同时我们发现原本开多个不同类型的子服丰富玩法的模式在SoTap实践的这段时间收效甚微，玩家并没有怎么使用到这些子服，而大量子服又让SoTap开支巨大。因此我们决定全面转型。转变为SoTap兴趣圈子，同时删减服务器，变为2个服务器。一个外服一个内服。之前休服的服务器变成了有白名单的内服，外服将会是一个新开的服务器，外服无白名单。我们希望通过这种内外分服的模式让老玩家新玩家都能有友好的游戏体验。外服吸纳新玩家，内服将外服优秀的玩家吸纳进来，通过内服优秀的建筑和作品吸引新玩家来SoTap，如此形成良性循环。"
      }
    ]
  },
  {
    "year": 2021,
    "events": [
      {
        "name": "1月",
		"title": "SoTap外服开启",
        "text": "经过一个月的规划和筹备，SoTap外服正式开服。外服主要的特色在于自由、最小限制、原版生存、无白名单。相比于内服，它给玩家的游戏空间更大，也让玩家有更多的新鲜感，外服是会持续开新图的，也适合吸纳新玩家。"
      }
    ]
  }
]
